; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v1 - type_2 ?v2 - type_1)
 	      (pred_2 ?v6 - object ?v2 - type_1)
	      (pred_1 ?v1 - type_2 ?v7 - type_3)
	      (pred_4 ?v1 - type_2 ?v6 - object ?v7 - type_3))

   (:action op_3
       :parameters  (?v1 - type_2 ?v3 ?v8 - type_1)
       :precondition (and  (pred_3 ?v1 ?v3))
       :effect (and  (pred_3 ?v1 ?v8)
		     (not (pred_3 ?v1 ?v3))))

   (:action op_1
       :parameters (?v1 - type_2 ?v5 - object ?v4 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v4) (pred_3 ?v1 ?v4) (pred_1 ?v1 ?v7))
       :effect (and (pred_4 ?v1 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v4)) 
		    (not (pred_1 ?v1 ?v7))))

   (:action op_2
       :parameters (?v1 - type_2 ?v5 - object ?v4 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v1 ?v5 ?v7) (pred_3 ?v1 ?v4))
       :effect (and (pred_2 ?v5 ?v4)
		    (pred_1 ?v1 ?v7)
		    (not (pred_4 ?v1 ?v5 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_06 obj_05 - type_2
obj_08 obj_10 obj_09 obj_01 - type_3
obj_07 obj_13 obj_11 obj_02 - type_1
obj_04 obj_03 obj_14 obj_12 - object)
(:init
(pred_3 obj_06 obj_11)
(pred_1 obj_06 obj_08)
(pred_1 obj_06 obj_10)
(pred_3 obj_05 obj_07)
(pred_1 obj_05 obj_09)
(pred_1 obj_05 obj_01)
(pred_2 obj_04 obj_13)
(pred_2 obj_03 obj_02)
(pred_2 obj_14 obj_07)
(pred_2 obj_12 obj_11)
)
(:goal
(and
(pred_2 obj_04 obj_13)
(pred_2 obj_03 obj_07)
(pred_2 obj_14 obj_07)
(pred_2 obj_12 obj_11)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_06 obj_02) (pred_3 obj_05 obj_02))))
  )
)
)

; plan
1. (op_3 obj_06 obj_11 obj_02)
   deleted: (pred_3 obj_06 obj_11)
   added: (pred_3 obj_06 obj_02)
   goals met: 3 of 4
2. (op_1 obj_06 obj_03 obj_02 obj_10)
   deleted: (pred_2 obj_03 obj_02) (pred_1 obj_06 obj_10)
   added: (pred_4 obj_06 obj_03 obj_10)
   goals met: 3 of 4
3. (op_3 obj_06 obj_02 obj_07)
   deleted: (pred_3 obj_06 obj_02)
   added: (pred_3 obj_06 obj_07)
   goals met: 3 of 4
4. (op_2 obj_06 obj_03 obj_07 obj_10)
   deleted: (pred_4 obj_06 obj_03 obj_10)
   added: (pred_2 obj_03 obj_07) (pred_1 obj_06 obj_10)
   goals met: 4 of 4
